{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"keras_tensor_5": {"name": "keras_tensor_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "23"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "23"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "23"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Relu", "op": "_FusedMatMul", "input": ["keras_tensor_5", "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_3_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "shape": [23, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp", "shape": [64, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}